/* (Action Extension - Adguard Assistant) Assistant UI. Title for 'Adguard icon' button */
"accept_caption" = "Nõustu";

/* (AEService) The default message for an unknown error. */
"support_unexpected_error" = "Ilmnes viga. Pöördu meie tehnilise toe poole.";

/* (Action Extension - ActionViewController) An error which occurs if the action extension is launched before the main Adguard app. */
"action_extension_no_configuration_message_format" = "Enne, kui seda lisa kasutada saad, peab %1$@ sooritama esmase konfigureerimise. Käivita  %2$@ põhiline äpp ja lase see ära teha.";

/* (AESFilterConverter) Error occured when checking of the result from JSON converter. */
"support_rule_converting_error" = "Reegleid ei õnnestu konventeerida. Ilmnes ootamatu viga. Kontakteeru meie tugiteenusega. ";

/* (AEService) Service errors descriptions */
"json_converting_error" = "JSON formaati konventeerimist ei õnnestu alustada!";

/* (AEUIAboutController) Alert message if user have no e-mail account on device */
"support_message_sending_error" = "Tugiteenusele ei saa sõnumit saata, sest e-posti konto pole üles seatud.";

/* (Action Extension - Adguard Assistant) Assistant UI. Title for 'close icon' button */
"common_action_cancel" = "Katkesta";

/* (AEService) Service errors descriptions */
"rule_converting_error" = "Reeglit ei õnnestu konvertida.  Reegli tekst on vale.";

/* (AEUIUtils) User filter convertering error description. */
"filter_rules_converting_error" = "Kasutaja reegleid ei õnnestu konvertida. Ühes reeglis on viga. Vaata üle reegel, mis jääb praeguse kursori positsiooni juurde.";

/* (Action Extension - AEAUIMainController) Label on switcher. Example: 'Enable filtering on www.github.com' */
"enable_filtering_format" = "Luba filtreerimine lehel %@";

/* Alert title. On error. */
"common_error_title" = "Viga";

/* (AEService) Service errors descriptions */
"safari_filters_loading_error" = "Filtreid ei õnnestu Safarisse laadida. Selle tõttu ei rakendatud sinu muudatusi.";

/* (Action Extension - AEAUIMainController) Mail body to support team about incorrect blocking */
"incorrect_blocking_page_format" = "Vale blokeerimine lehel:\n%@";

/* (AEUILoadingModal) Standard message when filter conversion is performed. */
"safari_filters_loading" = "Filtrite laadimine Safarisse. Palun ära sulge AdGuardi. See protsess võtab umbes 30 sekundit...";

/* (Action Extension - AEAUIMainController) error occurs when content blocker is disabled. */
"content_blocker_disabled_format" = "Pane tähele, et Sisu blokeerija on väljas. See tähendab, et reklaame ei filtreerita (olenemata AdGuardi seadistustest). Filtreerimise võimaldamiseks lülita palun Safari seadetes AdGuardi Sisu blokeerija sisse.";

/* (Action Extension - Adguard Assistant) Assistant UI. Title for 'eye icon' button */
"preview_caption" = "Eelvaade";

/* (Action Extension - ActionViewController) Can't obtain hostname when starting. */
"hostname_obtaining_error" = "Hosti nime ei suudeta hankida. Ehk pole lehekülg veel täielikult laaditud.";

/* (Action Extension - AEAUIMainController) error occurs when click on Block Element button. */
"assistant_launching_unable" = "Selle lehe turvapoliitika ei luba AdGuardi abimehel käivituda.";

/* (Action Extension - ActionViewController) Some errors when starting. */
"support_error_safari_extension" = "Ilmnes ootamatu viga Safari tegevuslisa käivitamisel. Kui see juhtub veel, siis palun kontakteeru AdGuardi tugiteenusega.";

/* (APUIAdguardDNSController) PRO version. Alert title. On warning. */
"common_warning_title" = "Hoiatus";

/* (Action Extension - AEAUIMainController) error occurs when try turn off filtration on site. */
"filter_rules_maximum" = "Oled ületanud maksimum arvu filtrite reegleid.";

